wendaoxyp/G350/bootloader/Microchip Solutions/Microchip/PIC24F Serial Bootloader/boot.c
/********************************************************************
 *
 * PIC24F Serial Bootloader
 *
 *********************************************************************
 * FileName:		boot.c
 * Dependencies: memory.c, config.h, GenericTypeDefs.h 
 * Processor:	PIC24F Family
 * Compiler:		C30 v3.00 or later
 * Company:		Microchip Technology, Inc.
 *
 * Software License Agreement:
 *
 * The software supplied herewith by Microchip Technology Incorporated
 * (the ?ompany? for its PICmicro?Microcontroller is intended and
 * supplied to you, the Company? customer, for use solely and
 * exclusively on Microchip PICmicro Microcontroller products. The
 * software is owned by the Company and/or its supplier, and is
 * protected under applicable copyright laws. All rights are reserved.
 * Any use in violation of the foregoing restrictions may subject the
 * user to criminal sanctions under applicable laws, as well as to
 * civil liability for the breach of the terms and conditions of this
 * license.
 *
 * THIS SOFTWARE IS PROVIDED IN AN ?S IS?CONDITION. NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FrOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 * IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * 
 * File Description:
 *
 * Bootloader for PIC24F devices compatable with AN851 communication protocol
 * Based on PIC24F UART bootloader and PIC16/18 AN851 bootloader
 *
 *
 * Change History:
 *
 * Author      	Revision #      Date        Comment
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Brant Ivey	1.00   			1-17-2008	Initial release of AN1157
 * Brant Ivey    1.02            11-17-2008  Updated 'K' device support
 *                                           Added extra configuration options
 ********************************************************************/

//Includes *******************************
#include <p24F32KA302.h>

#include "PIC24F Serial Bootloader\config.h"
//****************************************


//Globals ********************************
WORD responseBytes; //number of bytes in command response
DWORD_VAL sourceAddr; //general purpose address variable
DWORD_VAL userReset; //user code reset vector
DWORD_VAL userTimeout; //bootloader entry timeout value
WORD userResetRead; //bool - for relocating user reset vector

//Variables for storing runaway code protection keys
#ifdef USE_RUNAWAY_PROTECT
volatile WORD writeKey1 = 0xFFFF;
volatile WORD writeKey2 = 0x5555;
volatile WORD keyTest1 = 0x0000;
volatile WORD keyTest2 = 0xAAAA;
#endif

//Transmit/Recieve Buffer
BYTE buffer[MAX_PACKET_SIZE + 1];
//****************************************

//Configuration bits *********************
/*
 *	These configuration settings are not required for proper 
 *	bootloader operation and can be modified as desired.  
 *
 *	Refer to AN1157 troubleshooting for configuration suggestions
//*/
//#ifndef DEV_HAS_CONFIG_BITS
//    #ifdef DEV_HAS_USB
//    _CONFIG1(JTAGEN_OFF & GWRP_OFF & ICS_PGx2 & FWDTEN_OFF)
//    _CONFIG2(POSCMOD_HS & FNOSC_PRIPLL & PLLDIV_DIV2 & PLL_96MHZ_ON)
//    #else
//    _CONFIG1(JTAGEN_OFF & GWRP_OFF & ICS_PGx2 & FWDTEN_OFF)
//    _CONFIG2(POSCMOD_HS & FNOSC_PRIPLL)
//    #endif
//#else
//    _FOSCSEL(FNOSC_PRIPLL)
//    _FOSC(POSCFREQ_MS & POSCMOD_XT)
//    _FWDT(FWDTEN_OFF)
//    _FICD(ICS_PGx3)
//#endif  
//p24F32KA302
int FBS __attribute__((space(prog), address(0xF80000))) = 0xF;
//_FBS(
//    BWRP_OFF &           // Boot Segment Write Protect (Disabled)
//    BSS_OFF              // Boot segment Protect (No boot program flash segment)
//);
int FGS __attribute__((space(prog), address(0xF80004))) = 0x3;
//_FGS(
//    GWRP_OFF &           // General Segment Write Protect (General segment may be written)
//    GSS0_OFF             // General Segment Code Protect (No Protection)
//);
int FOSCSEL __attribute__((space(prog), address(0xF80006))) = 0xC0;
//_FOSCSEL(
//    FNOSC_FRC &          // Oscillator Select (Fast RC Oscillator (FRC))
//    SOSCSRC_DIG &        // SOSC Source Type (Digital Mode for use with external source)
//    LPRCSEL_HP &         // LPRC Oscillator Power and Accuracy (High Power, High Accuracy Mode)
//    IESO_ON              // Internal External Switch Over bit (Internal External Switchover mode enabled (Two-speed Start-up enabled))
//);
int FOSC __attribute__((space(prog), address(0xF80008))) = 0xFF;
//_FOSC(
//    POSCMOD_NONE &       // Primary Oscillator Configuration bits (Primary oscillator disabled)
//    OSCIOFNC_ON &        // CLKO Enable Configuration bit (CLKO output signal is active on the OSCO pin)
//    POSCFREQ_HS &        // Primary Oscillator Frequency Range Configuration bits (Primary oscillator/external clock input frequency greater than 8MHz)
//    SOSCSEL_SOSCHP &     // SOSC Power Selection Configuration bits (Secondary Oscillator configured for high-power operation)
//    FCKSM_CSDCMD         // Clock Switching and Monitor Selection (Both Clock Switching and Fail-safe Clock Monitor are disabled)
//);
int FWDT __attribute__((space(prog), address(0xF8000A))) = 0x5F;
//_FWDT(
//    WDTPS_PS32768 &      // Watchdog Timer Postscale Select bits (1:32768)
//    FWPSA_PR128 &        // WDT Prescaler bit (WDT prescaler ratio of 1:128)
//    FWDTEN_OFF &         // Watchdog Timer Enable bits (WDT disabled in hardware; SWDTEN bit disabled)
//    WINDIS_OFF           // Windowed Watchdog Timer Disable bit (Standard WDT selected(windowed WDT disabled))
//);
int FPOR __attribute__((space(prog), address(0xF8000C))) = 0xF4;
//_FPOR(
//    BOREN_BOR0 &         // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware, SBOREN bit disabled)
//    LVRCFG_OFF &         // Low Voltage Regulator Configuration bit (Low Voltage regulator is not available)
//    PWRTEN_OFF &         // Power-up Timer Enable bit (PWRT disabled)
//    I2C1SEL_PRI &        // Alternate I2C1 Pin Mapping bit (Use Default SCL1/SDA1 Pins For I2C1)
//    BORV_V18 &           // Brown-out Reset Voltage bits (Brown-out Reset set to lowest voltage (1.8V))
//    MCLRE_ON             // MCLR Pin Enable bit (RA5 input pin disabled,MCLR pin enabled)
//);
int FICD __attribute__((space(prog), address(0xF8000E))) = 0x82;
//_FICD(
//    ICS_PGx2             // ICD Pin Placement Select bits (EMUC/EMUD share PGC2/PGD2)
//);
int FDS __attribute__((space(prog), address(0xF80010))) = 0x1F;
//_FDS(
//    DSWDTPS_DSWDTPSF &   // Deep Sleep Watchdog Timer Postscale Select bits (1:2,147,483,648 (25.7 Days))
//    DSWDTOSC_LPRC &      // DSWDT Reference Clock Select bit (DSWDT uses Low Power RC Oscillator (LPRC))
//    DSBOREN_OFF &        // Deep Sleep Zero-Power BOR Enable bit (Deep Sleep BOR disabled in Deep Sleep)
//    DSWDTEN_OFF          // Deep Sleep Watchdog Timer Enable bit (DSWDT disabled)
//);
//****************************************

