wendaoxyp/G350/bootloader/Microchip Solutions/Microchip/PIC24F Serial Bootloader/boot.c
/********************************************************************
 * Function: 	int main()
 *
 * Precondition: None.
 *
 * Input: 		None.
 *
 * Output:		None.
 *
 * Side Effects:	Enables 32-bit Timer2/3.  Enables UART.
 *
 * Overview: 	Initialization of program and main loop.
 *			
 * Note:		 	None.
 ********************************************************************/
int main() {
    DWORD_VAL delay;

    //Setup bootloader entry delay
    sourceAddr.Val = DELAY_TIME_ADDR; //bootloader timer address
    delay.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW); //read BL timeout

    //Setup user reset vector
    sourceAddr.Val = USER_PROG_RESET;
    userReset.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW);

    //Prevent bootloader lockout - if no user reset vector, reset to BL start
    if (userReset.Val == 0xFFFFFF) {
        userReset.Val = BOOT_ADDR_LOW;
    }
    userResetRead = 0;


    //If timeout is zero, check reset state.
    if (delay.v[0] == 0) {

        //If device is returning from reset, BL is disabled call user code
        //otherwise assume the BL was called from use code and enter BL
        if (RCON & 0xFED3) {
            //If bootloader disabled, go to user code
            ResetDevice(userReset.Val);
        } else {
            delay.Val = 0xFF;
        }
    }


    T2CONbits.TON = 0;
    T2CONbits.T32 = 1; // Setup Timer 2/3 as 32 bit timer incrementing every clock
    IFS0bits.T3IF = 0; // Clear the Timer3 Interrupt Flag 
    IEC0bits.T3IE = 0; // Disable Timer3 Interrupt Service Routine 

    //Enable timer if not in always-BL mode
    if ((delay.Val & 0x000000FF) != 0xFF) {
        //Convert seconds into timer count value 
        delay.Val = ((DWORD) (FCY)) * ((DWORD) (delay.v[0]));

        PR3 = delay.word.HW; //setup timer timeout value
        PR2 = delay.word.LW;

        TMR2 = 0;
        TMR3 = 0;
        T2CONbits.TON = 1; //enable timer
    }


    //If using a part with PPS, map the UART I/O
#ifdef DEV_HAS_PPS
    ioMap();
#endif

    //Configure UART pins 
    TRISBbits.TRISB0 = 0; //U2TX
    TRISBbits.TRISB1 = 1; //U2RX
    //    Configure UART pins to be digital I/O.
    ANSBbits.ANSB1=0;

    UxBRG = 25;//9600((FCY + (BRG_DIV / 2 * BAUDRATE)) / BRG_DIV / BAUDRATE - 1); //BAUDRATEREG;

    UxMODEbits.UARTEN = 1; //enable uart
    UxSTAbits.UTXEN = 1; //enable receive
    TRISBbits.TRISB13=0;
    while (1) {
//        while (1) {
//            ClrWdt();
//            PutChar('a');
//        }
        LATBbits.LATB13^=1;
#ifdef USE_RUNAWAY_PROTECT
        writeKey1 = 0xFFFF; // Modify keys to ensure proper program flow
        writeKey2 = 0x5555;
#endif

        GetCommand(); //Get full AN851 command from UART

#ifdef USE_RUNAWAY_PROTECT
        writeKey1 += 10; // Modify keys to ensure proper program flow
        writeKey2 += 42;
#endif

        HandleCommand(); //Handle the command

        PutResponse(responseBytes); //Respond to sent command

    }//end while(1)

}//end main(void)

/********************************************************************
 * Function: 	void GetCommand()
 *
 * Precondition: UART Setup
 *
 * Input: 		None.
 *
 * Output:		None.
 *
 * Side Effects:	None.
 *
 * Overview: 	Polls the UART to recieve a complete AN851 command.
 *			 	Fills buffer[1024] with recieved data.
 *			
 * Note:		 	None.
 ********************************************************************/
void GetCommand() {

    BYTE RXByte;
    BYTE checksum;
    WORD dataCount;

    while (1) {

#ifndef USE_AUTOBAUD
        GetChar(&RXByte); //Get first STX
        if (RXByte == STX) {
#else
        AutoBaud(); //Get first STX and calculate baud rate
        RXByte = UxRXREG; //Dummy read
#endif

            T2CONbits.TON = 0; //disable timer - data received

            GetChar(&RXByte); //Read second byte
            if (RXByte == STX) { //2 STX, beginning of data

                checksum = 0; //reset data and checksum
                dataCount = 0;

                while (dataCount <= MAX_PACKET_SIZE + 1) { //maximum num bytes
                    GetChar(&RXByte);
                    switch (RXByte) {
                        case STX: //Start over if STX
                            checksum = 0;
                            dataCount = 0;
                            break;

                        case ETX: //End of packet if ETX
                            checksum = ~checksum + 1; //test checksum
                            Nop();
                            if (checksum == 0) return; //return if OK
                            dataCount = 0xFFFF; //otherwise restart
                            break;

                        case DLE: //If DLE, treat next as data
                            GetChar(&RXByte);
                        default: //get data, put in buffer
                            checksum += RXByte;
                            buffer[dataCount++] = RXByte;
                            break;

                    }//end switch(RXByte)
                }//end while(byteCount <= 1024)
            }//end if(RXByte == STX)

#ifndef USE_AUTOBAUD
        }//end if(RXByte == STX)
#endif
    }//end while(1)				

}//end GetCommand()

/********************************************************************
 * Function: 	void HandleCommand()
 *
 * Precondition: data in buffer
 *
 * Input: 		None.
 *
 * Output:		None.
 *
 * Side Effects:	None.
 *
 * Overview: 	Handles commands received from host
 *			
 * Note:		 	None.
 ********************************************************************/
void HandleCommand() {

    BYTE Command;
    BYTE length;

    //variables used in EE and CONFIG read/writes
#if (defined(DEV_HAS_EEPROM) || defined(DEV_HAS_CONFIG_BITS))	
    WORD i = 0;
    WORD_VAL temp;
    WORD bytesRead = 0;
#endif

    Command = buffer[0]; //get command from buffer
    length = buffer[1]; //get data length from buffer

    //RESET Command
    if (length == 0x00) {
        UxMODEbits.UARTEN = 0; //Disable UART
        ResetDevice(userReset.Val);
    }

