wendaoxyp/G350/bootloader/Microchip Solutions/Microchip/PIC24F Serial Bootloader/boot.c
    //get 24-bit address from buffer
    sourceAddr.v[0] = buffer[2];
    sourceAddr.v[1] = buffer[3];
    sourceAddr.v[2] = buffer[4];
    sourceAddr.v[3] = 0;

#ifdef USE_RUNAWAY_PROTECT
    writeKey1 |= (WORD) sourceAddr.Val; // Modify keys to ensure proper program flow
    writeKey2 = writeKey2 << 1;
#endif

    //Handle Commands		
    switch (Command) {
        case RD_VER: //Read version	
            buffer[2] = MINOR_VERSION;
            buffer[3] = MAJOR_VERSION;

            responseBytes = 4; //set length of reply
            break;

        case RD_FLASH: //Read flash memory
            ReadPM(length, sourceAddr);

            responseBytes = length * PM_INSTR_SIZE + 5; //set length of reply    									  
            break;

        case WT_FLASH: //Write flash memory

#ifdef USE_RUNAWAY_PROTECT
            writeKey1 -= length; // Modify keys to ensure proper program flow
            writeKey2 += Command;
#endif

            WritePM(length, sourceAddr);

            responseBytes = 1; //set length of reply
            break;

        case ER_FLASH: //Erase flash memory

#ifdef USE_RUNAWAY_PROTECT
            writeKey1 += length; // Modify keys to ensure proper program flow
            writeKey2 -= Command;
#endif

            ErasePM(length, sourceAddr);

            responseBytes = 1; //set length of reply
            break;

#ifdef DEV_HAS_EEPROM
        case RD_EEDATA: //Read EEPROM
            //if device has onboard EEPROM, allow EE reads

            //Read length words of EEPROM
            while (i < length * 2) {
                temp.Val = ReadLatch(sourceAddr.word.HW,
                        sourceAddr.word.LW);
                buffer[5 + i++] = temp.v[0];
                buffer[5 + i++] = temp.v[1];
                sourceAddr.Val += 2;
            }

            responseBytes = length * 2 + 5; //set length of reply
            break;

        case WT_EEDATA: //Write EEPROM

#ifdef USE_RUNAWAY_PROTECT
            writeKey1 -= length; // Modify keys to ensure proper program flow
            writeKey2 += Command;
#endif

            //Write length words of EEPROM
            while (i < length * 2) {
                temp.byte.LB = buffer[5 + i++]; //load data to write
                temp.byte.HB = buffer[5 + i++];

                WriteLatch(sourceAddr.word.HW, sourceAddr.word.LW,
                        0, temp.Val); //write data to latch

#ifdef USE_RUNAWAY_PROTECT
                writeKey1++;
                writeKey2--;

                //setup program flow protection test keys
                keyTest1 = (((0x0009 | (WORD) (sourceAddr.Val - i)) -
                        length) + i / 2) - 5;
                keyTest2 = (((0x557F << 1) + WT_EEDATA) - i / 2) + 6;

                //initiate write sequence
                WriteMem(EE_WORD_WRITE);

                writeKey1 += 5; // Modify keys to ensure proper program flow
                writeKey2 -= 6;
#else
                //initiate write sequence bypasssing runaway protection
                WriteMem(EE_WORD_WRITE);
#endif

                sourceAddr.Val += 2;
            }


            responseBytes = 1; //set length of reply
            break;
#endif

#ifdef DEV_HAS_CONFIG_BITS
        case RD_CONFIG: //Read config memory

            //Read length bytes from config memory
            while (bytesRead < length) {
                //read flash
                temp.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW);

                buffer[bytesRead + 5] = temp.v[0]; //put read data onto buffer

                bytesRead++;

                sourceAddr.Val += 2; //increment addr by 2
            }

            responseBytes = length + 5;

            break;
        case WT_CONFIG: //Write Config mem

            //Write length  bytes of config memory
            while (i < length) {
                temp.byte.LB = buffer[5 + i++]; //load data to write
                temp.byte.HB = 0;

#ifdef USE_RUNAWAY_PROTECT
                writeKey1++;
                writeKey2--;
#endif

                //Make sure that config write is inside implemented configuration space
                if (sourceAddr.Val >= CONFIG_START && sourceAddr.Val <= CONFIG_END) {

                    TBLPAG = sourceAddr.byte.UB;
                    __builtin_tblwtl(sourceAddr.word.LW, temp.Val);

#ifdef USE_RUNAWAY_PROTECT
                    //setup program flow protection test keys
                    keyTest1 = (((0x0009 | (WORD) (sourceAddr.Val - i * 2)) -
                            length) + i) - 5;
                    keyTest2 = (((0x557F << 1) + WT_CONFIG) - i) + 6;

                    //initiate write sequence
                    WriteMem(CONFIG_WORD_WRITE);

                    writeKey1 += 5; // Modify keys to ensure proper program flow
                    writeKey2 -= 6;
#else
                    //initiate write sequence bypasssing runaway protection
                    WriteMem(CONFIG_WORD_WRITE);
#endif

                }//end if(sourceAddr.Val...)

                sourceAddr.Val += 2;
            }//end while(i < length)

            responseBytes = 1; //set length of reply
            break;
#endif
        case VERIFY_OK:

#ifdef USE_RUNAWAY_PROTECT
            writeKey1 -= 1; // Modify keys to ensure proper program flow
            writeKey2 += Command;
#endif

            WriteTimeout();

            responseBytes = 1; //set length of reply
            break;

        default:
            break;
    }// end switch(Command)
}//end HandleCommand()

/********************************************************************
 * Function: 	void PutResponse()
 *
 * Precondition: UART Setup, data in buffer
 *
 * Input: 		None.
 *
 * Output:		None.
 *
 * Side Effects:	None.
 *
 * Overview: 	Transmits responseBytes bytes of data from buffer 
                with UART as a response to received command.
 *
 * Note:		 	None.
 ********************************************************************/
void PutResponse(WORD responseLen) {
    WORD i;
    BYTE data;
    BYTE checksum;

    UxSTAbits.UTXEN = 1; //make sure TX is enabled

