wendaoxyp/G350/bootloader/Microchip Solutions/Microchip/PIC24F Serial Bootloader/boot.c
    PutChar(STX); //Put 2 STX characters
    PutChar(STX);

    //Output buffer as response packet
    checksum = 0;
    for (i = 0; i < responseLen; i++) {
        asm("clrwdt"); //looping code so clear WDT

        data = buffer[i]; //get data from response buffer
        checksum += data; //accumulate checksum

        //if control character, stuff DLE
        if (data == STX || data == ETX || data == DLE) {
            PutChar(DLE);
        }

        PutChar(data); //send data
    }

    checksum = ~checksum + 1; //keep track of checksum

    //if control character, stuff DLE
    if (checksum == STX || checksum == ETX || checksum == DLE) {
        PutChar(DLE);
    }

    PutChar(checksum); //put checksum
    PutChar(ETX); //put End of text

    while (!UxSTAbits.TRMT); //wait for transmit to finish
}//end PutResponse()

/********************************************************************
 * Function: 	void PutChar(BYTE Char)
 *
 * Precondition: UART Setup
 *
 * Input: 		Char - Character to transmit
 *
 * Output: 		None
 *
 * Side Effects:	Puts character into destination pointed to by ptrChar.
 *
 * Overview: 	Transmits a character on UART2. 
 *	 			Waits for an empty spot in TXREG FIFO.
 *
 * Note:		 	None
 ********************************************************************/
void PutChar(BYTE txChar) {
    //    while (UxSTAbits.UTXBF); //wait for FIFO space
    UxTXREG = txChar; //put character onto UART FIFO to transmit
    //    while (!UxSTAbits.TRMT);
    while (!U2STAbits.TRMT);
}//end PutChar(BYTE Char)

/********************************************************************
 * Function:        void GetChar(BYTE * ptrChar)
 *
 * PreCondition:    UART Setup
 *
 * Input:		ptrChar - pointer to character received
 *
 * Output:		
 *
 * Side Effects:	Puts character into destination pointed to by ptrChar.
 *				Clear WDT
 *
 * Overview:		Receives a character from UART2.  
 *
 * Note:			None
 ********************************************************************/
void GetChar(BYTE * ptrChar) {
    BYTE dummy;
    while (1) {
        asm("clrwdt"); //looping code, so clear WDT

        //check for receive errors
        if ((UxSTA & 0x000E) != 0x0000) {
            dummy = UxRXREG; //dummy read to clear FERR/PERR
            UxSTAbits.OERR = 0; //clear OERR to keep receiving
        }

        //get the data
        if (UxSTAbits.URXDA == 1) {
            * ptrChar = UxRXREG; //get data from UART RX FIFO
            break;
        }

#ifndef USE_AUTOBAUD
        //if timer expired, jump to user code
        if (IFS0bits.T3IF == 1) {
            ResetDevice(userReset.Val);
        }
#endif
    }//end while(1)
}//end GetChar(BYTE *ptrChar)

/********************************************************************
 * Function:     void ReadPM(WORD length, DWORD_VAL sourceAddr)
 *
 * PreCondition: None
 *
 * Input:		length		- number of instructions to read
 *				sourceAddr 	- address to read from
 *
 * Output:		None
 *
 * Side Effects:	Puts read instructions into buffer.
 *
 * Overview:		Reads from program memory, stores data into buffer. 
 *
 * Note:			None
 ********************************************************************/
void ReadPM(WORD length, DWORD_VAL sourceAddr) {
    WORD bytesRead = 0;
    DWORD_VAL temp;

    //Read length instructions from flash
    while (bytesRead < length * PM_INSTR_SIZE) {
        //read flash
        temp.Val = ReadLatch(sourceAddr.word.HW, sourceAddr.word.LW);

        buffer[bytesRead + 5] = temp.v[0]; //put read data onto 
        buffer[bytesRead + 6] = temp.v[1]; //response buffer
        buffer[bytesRead + 7] = temp.v[2];
        buffer[bytesRead + 8] = temp.v[3];

        //4 bytes per instruction: low word, high byte, phantom byte
        bytesRead += PM_INSTR_SIZE;

        sourceAddr.Val = sourceAddr.Val + 2; //increment addr by 2
    }//end while(bytesRead < length*PM_INSTR_SIZE)
}//end ReadPM(WORD length, DWORD_VAL sourceAddr)

/********************************************************************
 * Function:     void WritePM(WORD length, DWORD_VAL sourceAddr)
 *
 * PreCondition: Page containing rows to write should be erased.
 *
 * Input:		length		- number of rows to write
 *				sourceAddr 	- row aligned address to write to
 *
 * Output:		None.
 *
 * Side Effects:	None.
 *
 * Overview:		Writes number of rows indicated from buffer into
 *				flash memory
 *
 * Note:			None
 ********************************************************************/
void WritePM(WORD length, DWORD_VAL sourceAddr) {
    WORD bytesWritten;
    DWORD_VAL data;
#ifdef USE_RUNAWAY_PROTECT
    WORD temp = (WORD) sourceAddr.Val;
#endif

    bytesWritten = 0; //first 5 buffer locations are cmd,len,addr	

    //write length rows to flash
    while ((bytesWritten) < length * PM_ROW_SIZE) {
        asm("clrwdt");

        //get data to write from buffer
        data.v[0] = buffer[bytesWritten + 5];
        data.v[1] = buffer[bytesWritten + 6];
        data.v[2] = buffer[bytesWritten + 7];
        data.v[3] = buffer[bytesWritten + 8];

        //4 bytes per instruction: low word, high byte, phantom byte
        bytesWritten += PM_INSTR_SIZE;

        //Flash configuration word handling
#ifndef DEV_HAS_CONFIG_BITS
        //Mask of bit 15 of CW1 to ensure it is programmed as 0
        //as noted in PIC24FJ datasheets
        if (sourceAddr.Val == CONFIG_END) {
            data.Val &= 0x007FFF;
        }
#endif

        //Protect the bootloader & reset vector
#ifdef USE_BOOT_PROTECT
        //protect BL reset & get user reset
        if (sourceAddr.Val == 0x0) {
            //get user app reset vector lo word
            userReset.Val = data.Val & 0xFFFF;

            //program low word of BL reset
            data.Val = 0x040000 + (0xFFFF & BOOT_ADDR_LOW);

            userResetRead = 1;
        }
        if (sourceAddr.Val == 0x2) {
            //get user app reset vector hi byte	
            userReset.Val += (DWORD) (data.Val & 0x00FF) << 16;

            //program high byte of BL reset
            data.Val = ((DWORD) (BOOT_ADDR_LOW & 0xFF0000)) >> 16;

