wendaoxyp/G350/bootloader/Microchip Solutions/Microchip/PIC24F Serial Bootloader/boot.c
            userResetRead = 1;
        }
#else
        //get user app reset vector lo word
        if (sourceAddr.Val == 0x0) {
            userReset.Val = data.Val & 0xFFFF;

            userResetRead = 1;
        }

        //get user app reset vector	hi byte
        if (sourceAddr.Val == 0x2) {
            userReset.Val |= ((DWORD) (data.Val & 0x00FF)) << 16;

            userResetRead = 1;
        }
#endif


        //put information from reset vector in user reset vector location
        if (sourceAddr.Val == USER_PROG_RESET) {
            if (userResetRead) { //has reset vector been grabbed from location 0x0?
                //if yes, use that reset vector
                data.Val = userReset.Val;
            } else {
                //if no, use the user's indicated reset vector
                userReset.Val = data.Val;
            }
        }

        //If address is delay timer location, store data and write empty word
        if (sourceAddr.Val == DELAY_TIME_ADDR) {
            userTimeout.Val = data.Val;
            data.Val = 0xFFFFFF;
        }

#ifdef USE_BOOT_PROTECT			//do not erase bootloader & reset vector
        if (sourceAddr.Val < BOOT_ADDR_LOW || sourceAddr.Val > BOOT_ADDR_HI) {
#endif

#ifdef USE_CONFIGWORD_PROTECT	//do not erase last page
            if (sourceAddr.Val < (CONFIG_START & 0xFFFC00)) {
#endif

#ifdef USE_VECTOR_PROTECT		//do not erase first page
                //if(sourceAddr.Val >= PM_PAGE_SIZE/2){
                if (sourceAddr.Val >= VECTOR_SECTION) {
#endif



                    //write data into latches
                    WriteLatch(sourceAddr.word.HW, sourceAddr.word.LW,
                            data.word.HW, data.word.LW);


#ifdef USE_VECTOR_PROTECT	
                }//end vectors protect
#endif

#ifdef USE_CONFIGWORD_PROTECT
            }//end config protect
#endif

#ifdef USE_BOOT_PROTECT
        }//end bootloader protect
#endif


#ifdef USE_RUNAWAY_PROTECT
        writeKey1 += 4; // Modify keys to ensure proper program flow
        writeKey2 -= 4;
#endif


        //write to flash memory if complete row is finished
        if ((bytesWritten % PM_ROW_SIZE) == 0) {

#ifdef USE_RUNAWAY_PROTECT
            //setup program flow protection test keys
            keyTest1 = (0x0009 | temp) - length + bytesWritten - 5;
            keyTest2 = (((0x557F << 1) + WT_FLASH) - bytesWritten) + 6;
#endif


#ifdef USE_BOOT_PROTECT			//Protect the bootloader & reset vector
            if ((sourceAddr.Val < BOOT_ADDR_LOW || sourceAddr.Val > BOOT_ADDR_HI)) {
#endif

#ifdef USE_CONFIGWORD_PROTECT	//do not erase last page
                if (sourceAddr.Val < (CONFIG_START & 0xFFFC00)) {
#endif

#ifdef USE_VECTOR_PROTECT		//do not erase first page
                    if (sourceAddr.Val >= VECTOR_SECTION) {
#endif


                        //execute write sequence
                        WriteMem(PM_ROW_WRITE);

#ifdef USE_RUNAWAY_PROTECT
                        writeKey1 += 5; // Modify keys to ensure proper program flow
                        writeKey2 -= 6;
#endif


#ifdef USE_VECTOR_PROTECT	
                    }//end vectors protect
#endif

#ifdef USE_CONFIGWORD_PROTECT
                }//end config protect
#endif	

#ifdef USE_BOOT_PROTECT
            }//end boot protect
#endif

        }

        sourceAddr.Val = sourceAddr.Val + 2; //increment addr by 2
    }//end while((bytesWritten-5) < length*PM_ROW_SIZE)
}//end WritePM(WORD length, DWORD_VAL sourceAddr)

/********************************************************************
 * Function:     void ErasePM(WORD length, DWORD_VAL sourceAddr)
 *
 * PreCondition: 
 *
 * Input:		length		- number of pages to erase
 *				sourceAddr 	- page aligned address to erase
 *
 * Output:		None.
 *
 * Side Effects:	None.
 *
 * Overview:		Erases number of pages from flash memory
 *
 * Note:			None
 ********************************************************************/
void ErasePM(WORD length, DWORD_VAL sourceAddr) {
    WORD i = 0;
#ifdef USE_RUNAWAY_PROTECT
    WORD temp = (WORD) sourceAddr.Val;
#endif

    while (i < length) {

        i++;

#ifdef USE_RUNAWAY_PROTECT
        writeKey1++; // Modify keys to ensure proper program flow
        writeKey2--;
#endif


        //if protection enabled, protect BL and reset vector
#ifdef USE_BOOT_PROTECT		
        if (sourceAddr.Val < BOOT_ADDR_LOW || //do not erase bootloader
                sourceAddr.Val > BOOT_ADDR_HI) {
#endif

#ifdef USE_CONFIGWORD_PROTECT		//do not erase last page
            if (sourceAddr.Val < (CONFIG_START & 0xFFFC00)) {
#endif

#ifdef USE_VECTOR_PROTECT			//do not erase first page
                if (sourceAddr.Val >= VECTOR_SECTION) {
#endif


#ifdef USE_RUNAWAY_PROTECT
                    //setup program flow protection test keys
                    keyTest1 = (0x0009 | temp) + length + i + 7;
                    keyTest2 = (0x557F << 1) - ER_FLASH - i + 3;
#endif


                    //perform erase
                    Erase(sourceAddr.word.HW, sourceAddr.word.LW, PM_PAGE_ERASE);


#ifdef USE_RUNAWAY_PROTECT
                    writeKey1 -= 7; // Modify keys to ensure proper program flow
                    writeKey2 -= 3;
#endif



#ifdef USE_VECTOR_PROTECT	
                }//end vectors protect

#elif  defined(USE_BOOT_PROTECT) || defined(USE_RESET_SAVE)
                    //Replace the bootloader reset vector
                    DWORD_VAL blResetAddr;

                    if (sourceAddr.Val < PM_PAGE_SIZE / 2) {

                        //Replace BL reset vector at 0x00 and 0x02 if erased
                        blResetAddr.Val = 0;

#ifdef USE_RUNAWAY_PROTECT
                        //setup program flow protection test keys
                        keyTest1 = (0x0009 | temp) + length + i;
                        keyTest2 = (0x557F << 1) - ER_FLASH - i;
#endif

                        replaceBLReset(blResetAddr);

                    }
#endif

#ifdef USE_CONFIGWORD_PROTECT
            }//end config protect
#endif

#ifdef USE_BOOT_PROTECT
        }//end bootloader protect
#endif


