wendaoxyp/G350/bootloader/Microchip Solutions/Microchip/PIC24F Serial Bootloader/boot.c
        sourceAddr.Val += PM_PAGE_SIZE / 2; //increment by a page

    }//end while(i<length)
}//end ErasePM

/********************************************************************
 * Function:     void WriteTimeout()
 *
 * PreCondition: The programmed data should be verified prior to calling
 * 				this funtion.
 *
 * Input:		None.
 *
 * Output:		None.
 *
 * Side Effects:	None.
 *
 * Overview:		This function writes the stored value of the bootloader
 *				timeout delay to memory.  This function should only
 *				be called after sucessful verification of the programmed
 *				data to prevent possible bootloader lockout
 *
 * Note:			None
 ********************************************************************/
void WriteTimeout() {
#ifdef USE_RUNAWAY_PROTECT
    WORD temp = (WORD) sourceAddr.Val;
#endif


    //Write timeout value to memory
#ifdef DEV_HAS_WORD_WRITE
    //write data into latches
    WriteLatch((DELAY_TIME_ADDR & 0xFF0000) >> 16,
            (DELAY_TIME_ADDR & 0x00FFFF),
            userTimeout.word.HW, userTimeout.word.LW);
#else
    DWORD_VAL address;
    WORD bytesWritten;

    bytesWritten = 0;
    address.Val = DELAY_TIME_ADDR & (0x1000000 - PM_ROW_SIZE / 2);

    //Program booloader entry delay to finalize bootloading
    //Load 0xFFFFFF into all other words in row to prevent corruption
    while (bytesWritten < PM_ROW_SIZE) {

        if (address.Val == DELAY_TIME_ADDR) {
            WriteLatch(address.word.HW, address.word.LW,
                    userTimeout.word.HW, userTimeout.word.LW);
        } else {
            WriteLatch(address.word.HW, address.word.LW,
                    0xFFFF, 0xFFFF);
        }

        address.Val += 2;
        bytesWritten += 4;
    }
#endif


#ifdef USE_RUNAWAY_PROTECT
    //setup program flow protection test keys
    keyTest1 = (0x0009 | temp) - 1 - 5;
    keyTest2 = ((0x557F << 1) + VERIFY_OK) + 6;
#endif


    //Perform write to enable BL timeout
#ifdef DEV_HAS_WORD_WRITE
    //execute write sequence
    WriteMem(PM_WORD_WRITE);
#else
    //execute write sequence
    WriteMem(PM_ROW_WRITE);
#endif



#ifdef USE_RUNAWAY_PROTECT
    writeKey1 += 5; // Modify keys to ensure proper program flow
    writeKey2 -= 6;
#endif


}//end WriteTimeout

/*********************************************************************
 * Function:     void AutoBaud()
 *
 * PreCondition: UART Setup
 *
 * Input:		None.
 *
 * Output:		None.
 *
 * Side Effects:	Resets WDT.  
 *
 * Overview:		Sets autobaud mode and waits for completion.
 *
 * Note:			Contains code to handle UART errata issues for
                PIC24FJ128 family parts, A2 and A3 revs.
 ********************************************************************/
void AutoBaud() {
    BYTE dummy;
    UxMODEbits.ABAUD = 1; //set autobaud mode

    while (UxMODEbits.ABAUD) //wait for sync character 0x55
    {
        asm("clrwdt"); //looping code so clear WDT

        //if timer expired, jump to user code
        if (IFS0bits.T3IF == 1) {
            ResetDevice(userReset.Val);
        }

        if (UxSTAbits.OERR) UxSTAbits.OERR = 0;
        if (UxSTAbits.URXDA) dummy = UxRXREG;
    }

    //Workarounds for autobaud errata in some silicon revisions
#ifdef USE_WORKAROUNDS
    //Workaround for autobaud innaccuracy
    if (UxBRG == 0xD) UxBRG--;
    if (UxBRG == 0x1A) UxBRG--;
    if (UxBRG == 0x09) UxBRG--;

#ifdef USE_HI_SPEED_BRG
    //Workarounds for ABAUD incompatability w/ BRGH = 1
    UxBRG = (UxBRG + 1)*4 - 1;
    if (UxBRG == 0x13) UxBRG = 0x11;
    if (UxBRG == 0x1B) UxBRG = 0x19;
    if (UxBRG == 0x08) UxBRG = 0x22;

    //Workaround for Odd BRG recieve error when BRGH = 1		
    if (UxBRG & 0x0001) UxBRG++;
#endif
#endif

}//end AutoBaud()




#ifdef DEV_HAS_PPS

/*********************************************************************
 * Function:     void ioMap()
 *
 * PreCondition: None.
 *
 * Input:		None.
 *
 * Output:		None.
 *
 * Side Effects:	Locks IOLOCK bit.
 *
 * Overview:		Maps UART IO for communications on PPS devices.  
 *
 * Note:			None.
 ********************************************************************/
void ioMap() {

    //Clear the IOLOCK bit
    __builtin_write_OSCCONL(OSCCON & 0xFFBF);

    //INPUTS **********************
    PPS_URX_REG = PPS_URX_PIN; //UxRX = RP19

    //OUTPUTS *********************
    PPS_UTX_PIN = UxTX_IO; //RP25 = UxTX   

    //Lock the IOLOCK bit so that the IO is not accedentally changed.
    __builtin_write_OSCCONL(OSCCON | 0x0040);

}//end ioMap()
#endif



#if defined(USE_BOOT_PROTECT) || defined(USE_RESET_SAVE)

/*********************************************************************
 * Function:     void replaceBLReset(DWORD_VAL sourceAddr)
 *
 * PreCondition: None.
 *
 * Input:		sourceAddr - the address to begin writing reset vector
 *
 * Output:		None.
 *
 * Side Effects:	None.
 *
 * Overview:		Writes bootloader reset vector to input memory location
 *
 * Note:			None.
 ********************************************************************/
void replaceBLReset(DWORD_VAL sourceAddr) {
    DWORD_VAL data;
#ifndef DEV_HAS_WORD_WRITE
    WORD i;
#endif
#ifdef USE_RUNAWAY_PROTECT
    WORD tempkey1;
    WORD tempkey2;

    tempkey1 = keyTest1;
    tempkey2 = keyTest2;
#endif


    //get BL reset vector low word and write
    data.Val = 0x040000 + (0xFFFF & BOOT_ADDR_LOW);
    WriteLatch(sourceAddr.word.HW, sourceAddr.word.LW, data.word.HW, data.word.LW);


    //Write low word back to memory on word write capable devices
#ifdef DEV_HAS_WORD_WRITE
#ifdef USE_RUNAWAY_PROTECT
    writeKey1 += 5; // Modify keys to ensure proper program flow
    writeKey2 -= 6;
#endif

    //perform BL reset vector word write bypassing flow protect
    WriteMem(PM_WORD_WRITE);
#endif


    //get BL reset vector high byte and write
    data.Val = ((DWORD) (BOOT_ADDR_LOW & 0xFF0000)) >> 16;
    WriteLatch(sourceAddr.word.HW, sourceAddr.word.LW + 2, data.word.HW, data.word.LW);


#ifdef USE_RUNAWAY_PROTECT
    keyTest1 = tempkey1;
    keyTest2 = tempkey2;
#endif

    //Write high byte back to memory on word write capable devices
#ifdef DEV_HAS_WORD_WRITE
#ifdef USE_RUNAWAY_PROTECT
    writeKey1 += 5; // Modify keys to ensure proper program flow
    writeKey2 -= 6;
#endif

    //perform BL reset vector word write
    WriteMem(PM_WORD_WRITE);

    //Otherwise initialize row of memory to F's and write row containing reset
#else

    for (i = 4; i < (PM_ROW_SIZE / PM_INSTR_SIZE * 2); i += 2) {
        WriteLatch(sourceAddr.word.HW, sourceAddr.word.LW + i, 0xFFFF, 0xFFFF);
    }

#ifdef USE_RUNAWAY_PROTECT
    writeKey1 += 5; // Modify keys to ensure proper program flow
    writeKey2 -= 6;
#endif

    //perform BL reset vector word write
    WriteMem(PM_ROW_WRITE);

#endif

}//end replaceBLReset()
#endif
